# IdeaStatiCa.RcsApi.Model.BendData
Provides data of bend

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Plate1Id** | **int** | First plate | [optional]
**Plate2Id** | **int** | Second plate | [optional]
**Radius** | **double** | Radius of bend | [optional]
**Point1OfSideBoundary1** | **Point3D** |  | [optional]
**Point2OfSideBoundary1** | **Point3D** |  | [optional]
**EndFaceNormal1** | **Vector3D** |  | [optional]
**Point1OfSideBoundary2** | **Point3D** |  | [optional]
**Point2OfSideBoundary2** | **Point3D** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)